<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Resources/Info.plist</key>
		<data>
		0wRNMX+4ufRKMYwi3STzk9Kenas=
		</data>
		<key>Resources/realesrgan512_8.mlmodelc/analytics/coremldata.bin</key>
		<data>
		neTzvV7wGqhRg/KUI1kcMfNP990=
		</data>
		<key>Resources/realesrgan512_8.mlmodelc/coremldata.bin</key>
		<data>
		eHCsoMCU9kmIsN8oOTor7RMSYik=
		</data>
		<key>Resources/realesrgan512_8.mlmodelc/metadata.json</key>
		<data>
		kSWi0qZI51ZOiZEsh3JMx3ybyF4=
		</data>
		<key>Resources/realesrgan512_8.mlmodelc/model.espresso.net</key>
		<data>
		kVjdPHqVypzUvOvBsSeRqYlNxn0=
		</data>
		<key>Resources/realesrgan512_8.mlmodelc/model.espresso.shape</key>
		<data>
		Vs9+LHVqe2hMDosbZngtcII1VaQ=
		</data>
		<key>Resources/realesrgan512_8.mlmodelc/model.espresso.weights</key>
		<data>
		XGVb1tb4a0J+mO7MhTTm/t2mOOQ=
		</data>
		<key>Resources/realesrgan512_8.mlmodelc/model/coremldata.bin</key>
		<data>
		BAcGz5nP3d6p5ZJBOTSb+iF6Wa0=
		</data>
		<key>Resources/realesrgan512_8.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		tkgF5pxT7RlO+9uypQti9obolyA=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Headers/libAISR4x.h</key>
		<dict>
			<key>hash2</key>
			<data>
			xrD0mSPB9QwYVUOoAVC9jgUlmItcrZpI0qwKVO94kM0=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash2</key>
			<data>
			2792ED+Upq5Wif2ko8qAsMeWhCjWgJkZ0WcnTSNi5u8=
			</data>
		</dict>
		<key>Resources/Info.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			/SslN6+aeOhnrb9nT3jMKz2cR5Vc4mdIrIc5ciWoE5o=
			</data>
		</dict>
		<key>Resources/realesrgan512_8.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			nGmNhDgfS2jPoMBdWXioNdkyQQnLj+jG71BwkomoR4Q=
			</data>
		</dict>
		<key>Resources/realesrgan512_8.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			Dnpq1almPnsF8RGHooqoH7TbzQJC3lQwLpXL/+C7Mok=
			</data>
		</dict>
		<key>Resources/realesrgan512_8.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			ID40awfsF3pnFgRi/x8L3lrJX+4Ael314FaVRoS8nDc=
			</data>
		</dict>
		<key>Resources/realesrgan512_8.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			BIpQtGb0CqJgQLKsBfW/PYilUuU5W5Fb3fnBIYsqe8s=
			</data>
		</dict>
		<key>Resources/realesrgan512_8.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			r7WqQcglxsXfopa5XFYnwRRze9KG1xP1v1eBxgB1ZpI=
			</data>
		</dict>
		<key>Resources/realesrgan512_8.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			bPY0T0b0EASDjHHmb65lJfj5OoZqFpM2QVqmah0wVkE=
			</data>
		</dict>
		<key>Resources/realesrgan512_8.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			8h7KONKYEx+DqOLQr00ATInPArA1kULynzXM/tcXx/A=
			</data>
		</dict>
		<key>Resources/realesrgan512_8.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			WTG9U2xFUClKISxvyNPBvuddqBeYC6C2cchgPa+zYjg=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^Resources/</key>
		<true/>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^(Frameworks|SharedFrameworks|PlugIns|Plug-ins|XPCServices|Helpers|MacOS|Library/(Automator|Spotlight|LoginItems))/</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^[^/]+$</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
