{
  "transform_params" : {
    "src" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 0.0039215688593685627
    }
  },
  "properties" : {

  },
  "analyses" : {

  },
  "format_version" : 200,
  "storage" : "model.espresso.weights",
  "layers" : [
    {
      "bottom" : "src",
      "target_size_w" : 480,
      "spatial_scale" : 1,
      "weights" : {

      },
      "grid_sampling_mode" : 0,
      "debug_info" : "tensor.1",
      "target_size_h" : 270,
      "top" : "tensor.1",
      "type" : "crop_and_resize",
      "name" : "tensor.1",
      "crop_index_mode" : 0
    },
    {
      "top" : "mean",
      "w" : 1,
      "h" : 1,
      "name" : "mean",
      "nd_rank" : 3,
      "type" : "load_constant",
      "k" : 3,
      "bottom" : "",
      "debug_info" : "mean",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 1
    },
    {
      "alpha" : -1,
      "bottom" : "mean",
      "weights" : {

      },
      "mode" : 6,
      "debug_info" : "_neg_y_tensor",
      "top" : "_neg_y_tensor",
      "type" : "activation",
      "name" : "_neg_y_tensor",
      "beta" : 0
    },
    {
      "bottom" : "tensor.1,_neg_y_tensor",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "tensor",
      "top" : "tensor",
      "type" : "elementwise",
      "name" : "tensor",
      "beta" : 0
    },
    {
      "top" : "_inversed_input.2_y_0",
      "w" : 1,
      "h" : 1,
      "name" : "_inversed_input.2_y_0",
      "nd_rank" : 3,
      "type" : "load_constant",
      "k" : 3,
      "bottom" : "",
      "debug_info" : "_inversed_input.2_y_0",
      "n" : 1,
      "weights" : {

      },
      "constant_blob" : 3
    },
    {
      "bottom" : "tensor,_inversed_input.2_y_0",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "_inversed_input.2",
      "top" : "_inversed_input.2",
      "type" : "elementwise",
      "name" : "_inversed_input.2",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.4",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.4",
      "K" : 3,
      "blob_biases" : 5,
      "stride_x" : 2,
      "name" : "input.4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "_inversed_input.2",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 7
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.4",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "sigmoid_hard_0",
      "top" : "sigmoid_hard_0",
      "type" : "activation",
      "name" : "sigmoid_hard_0",
      "beta" : 0.5
    },
    {
      "bottom" : "input.4,sigmoid_hard_0",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.5",
      "top" : "input.5",
      "type" : "elementwise",
      "name" : "input.5",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.7",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.8",
      "K" : 16,
      "blob_biases" : 9,
      "name" : "input.7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 16,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input.5",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 11
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "result.1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "result.1",
      "K" : 16,
      "blob_biases" : 13,
      "name" : "result.1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "input.8",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 15
    },
    {
      "bottom" : "input.5,result.1",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.10",
      "top" : "input.10",
      "type" : "elementwise",
      "name" : "input.10",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.12",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.13",
      "K" : 16,
      "blob_biases" : 17,
      "name" : "input.12",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.10",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 19
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.15",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.16",
      "K" : 64,
      "blob_biases" : 21,
      "stride_x" : 2,
      "name" : "input.15",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "input.13",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 23
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.18",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.18",
      "K" : 64,
      "blob_biases" : 25,
      "name" : "input.18",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "input.16",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 27
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.20",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.21",
      "K" : 24,
      "blob_biases" : 29,
      "name" : "input.20",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "input.18",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 31
    },
    {
      "pad_r" : 1,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.23",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.24",
      "K" : 72,
      "blob_biases" : 33,
      "name" : "input.23",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 72,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "input.21",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 35
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "result.2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "result.2",
      "K" : 72,
      "blob_biases" : 37,
      "name" : "result.2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "input.24",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 39
    },
    {
      "bottom" : "input.18,result.2",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.26",
      "top" : "input.26",
      "type" : "elementwise",
      "name" : "input.26",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.28",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.29",
      "K" : 24,
      "blob_biases" : 41,
      "name" : "input.28",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "input.26",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 43
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.31",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "input.32",
      "K" : 72,
      "blob_biases" : 45,
      "stride_x" : 2,
      "name" : "input.31",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 72,
      "pad_t" : 2,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "input.29",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 47
    },
    {
      "pad_r" : 0,
      "debug_info" : "input.33",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 60,
      "is_global" : 1,
      "top" : "input.33",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "input.33",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "input.32",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 34,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.34",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.35",
      "K" : 72,
      "blob_biases" : 49,
      "name" : "input.34",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 24,
      "bottom" : "input.33",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 51
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.36",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.36",
      "K" : 24,
      "blob_biases" : 53,
      "name" : "input.36",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 72,
      "bottom" : "input.35",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 55
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.36",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "scale.1",
      "top" : "scale.1",
      "type" : "activation",
      "name" : "scale.1",
      "beta" : 0.5
    },
    {
      "bottom" : "scale.1,input.32",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.37",
      "nd_mode" : true,
      "top" : "input.37",
      "type" : "elementwise",
      "name" : "input.37",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.39",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.39",
      "K" : 72,
      "blob_biases" : 57,
      "name" : "input.39",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 40,
      "bottom" : "input.37",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 59
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.41",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.42",
      "K" : 40,
      "blob_biases" : 61,
      "name" : "input.41",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 120,
      "bottom" : "input.39",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 63
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.44",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "input.45",
      "K" : 120,
      "blob_biases" : 65,
      "name" : "input.44",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 120,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 120,
      "bottom" : "input.42",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 67
    },
    {
      "pad_r" : 0,
      "debug_info" : "input.46",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 60,
      "is_global" : 1,
      "top" : "input.46",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "input.46",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "input.45",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 34,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.47",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.48",
      "K" : 120,
      "blob_biases" : 69,
      "name" : "input.47",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.46",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 71
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.49",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.49",
      "K" : 32,
      "blob_biases" : 73,
      "name" : "input.49",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 120,
      "bottom" : "input.48",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 75
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.49",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "scale.2",
      "top" : "scale.2",
      "type" : "activation",
      "name" : "scale.2",
      "beta" : 0.5
    },
    {
      "bottom" : "scale.2,input.45",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.50",
      "nd_mode" : true,
      "top" : "input.50",
      "type" : "elementwise",
      "name" : "input.50",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "result.3",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "result.3",
      "K" : 120,
      "blob_biases" : 77,
      "name" : "result.3",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 40,
      "bottom" : "input.50",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 79
    },
    {
      "bottom" : "result.3,input.39",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.52",
      "nd_mode" : true,
      "top" : "input.52",
      "type" : "elementwise",
      "name" : "input.52",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.54",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.55",
      "K" : 40,
      "blob_biases" : 81,
      "name" : "input.54",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 120,
      "bottom" : "input.52",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 83
    },
    {
      "pad_r" : 2,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.57",
      "pad_fill_mode" : 0,
      "pad_b" : 2,
      "pad_l" : 2,
      "top" : "input.58",
      "K" : 120,
      "blob_biases" : 85,
      "name" : "input.57",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 120,
      "pad_t" : 2,
      "has_biases" : 1,
      "C" : 120,
      "bottom" : "input.55",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "blob_weights_f16" : 87
    },
    {
      "pad_r" : 0,
      "debug_info" : "input.59",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 60,
      "is_global" : 1,
      "top" : "input.59",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "input.59",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "input.58",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 34,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.60",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.61",
      "K" : 120,
      "blob_biases" : 89,
      "name" : "input.60",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "input.59",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 91
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.62",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.62",
      "K" : 32,
      "blob_biases" : 93,
      "name" : "input.62",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 120,
      "bottom" : "input.61",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 95
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.62",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "scale.3",
      "top" : "scale.3",
      "type" : "activation",
      "name" : "scale.3",
      "beta" : 0.5
    },
    {
      "bottom" : "scale.3,input.58",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.63",
      "nd_mode" : true,
      "top" : "input.63",
      "type" : "elementwise",
      "name" : "input.63",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "result.4",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "result.4",
      "K" : 120,
      "blob_biases" : 97,
      "name" : "result.4",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 40,
      "bottom" : "input.63",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 99
    },
    {
      "bottom" : "result.4,input.52",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.65",
      "nd_mode" : true,
      "top" : "input.65",
      "type" : "elementwise",
      "name" : "input.65",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.67",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.67",
      "K" : 40,
      "blob_biases" : 101,
      "name" : "input.67",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 240,
      "bottom" : "input.65",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 103
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.67",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "sigmoid_hard_1",
      "top" : "sigmoid_hard_1",
      "type" : "activation",
      "name" : "sigmoid_hard_1",
      "beta" : 0.5
    },
    {
      "bottom" : "input.67,sigmoid_hard_1",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.68",
      "top" : "input.68",
      "type" : "elementwise",
      "name" : "input.68",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.70",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.70",
      "K" : 240,
      "blob_biases" : 105,
      "stride_x" : 2,
      "name" : "input.70",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 240,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 240,
      "bottom" : "input.68",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 107
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.70",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "sigmoid_hard_2",
      "top" : "sigmoid_hard_2",
      "type" : "activation",
      "name" : "sigmoid_hard_2",
      "beta" : 0.5
    },
    {
      "bottom" : "input.70,sigmoid_hard_2",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.71",
      "top" : "input.71",
      "type" : "elementwise",
      "name" : "input.71",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.73",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.73",
      "K" : 240,
      "blob_biases" : 109,
      "name" : "input.73",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 80,
      "bottom" : "input.71",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 111
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.75",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.75",
      "K" : 80,
      "blob_biases" : 113,
      "name" : "input.75",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 200,
      "bottom" : "input.73",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 115
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.75",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "sigmoid_hard_3",
      "top" : "sigmoid_hard_3",
      "type" : "activation",
      "name" : "sigmoid_hard_3",
      "beta" : 0.5
    },
    {
      "bottom" : "input.75,sigmoid_hard_3",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.76",
      "top" : "input.76",
      "type" : "elementwise",
      "name" : "input.76",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.78",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.78",
      "K" : 200,
      "blob_biases" : 117,
      "name" : "input.78",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 200,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 200,
      "bottom" : "input.76",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 119
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.78",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "sigmoid_hard_4",
      "top" : "sigmoid_hard_4",
      "type" : "activation",
      "name" : "sigmoid_hard_4",
      "beta" : 0.5
    },
    {
      "bottom" : "input.78,sigmoid_hard_4",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.79",
      "top" : "input.79",
      "type" : "elementwise",
      "name" : "input.79",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "result.5",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "result.5",
      "K" : 200,
      "blob_biases" : 121,
      "name" : "result.5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 80,
      "bottom" : "input.79",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 123
    },
    {
      "bottom" : "result.5,input.73",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.81",
      "nd_mode" : true,
      "top" : "input.81",
      "type" : "elementwise",
      "name" : "input.81",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.83",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.83",
      "K" : 80,
      "blob_biases" : 125,
      "name" : "input.83",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 184,
      "bottom" : "input.81",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 127
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.83",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "sigmoid_hard_5",
      "top" : "sigmoid_hard_5",
      "type" : "activation",
      "name" : "sigmoid_hard_5",
      "beta" : 0.5
    },
    {
      "bottom" : "input.83,sigmoid_hard_5",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.84",
      "top" : "input.84",
      "type" : "elementwise",
      "name" : "input.84",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.86",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.86",
      "K" : 184,
      "blob_biases" : 129,
      "name" : "input.86",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 184,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 184,
      "bottom" : "input.84",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 131
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.86",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "sigmoid_hard_6",
      "top" : "sigmoid_hard_6",
      "type" : "activation",
      "name" : "sigmoid_hard_6",
      "beta" : 0.5
    },
    {
      "bottom" : "input.86,sigmoid_hard_6",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.87",
      "top" : "input.87",
      "type" : "elementwise",
      "name" : "input.87",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "result.6",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "result.6",
      "K" : 184,
      "blob_biases" : 133,
      "name" : "result.6",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 80,
      "bottom" : "input.87",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 135
    },
    {
      "bottom" : "result.6,input.81",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.89",
      "nd_mode" : true,
      "top" : "input.89",
      "type" : "elementwise",
      "name" : "input.89",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.91",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.91",
      "K" : 80,
      "blob_biases" : 137,
      "name" : "input.91",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 184,
      "bottom" : "input.89",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 139
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.91",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "sigmoid_hard_7",
      "top" : "sigmoid_hard_7",
      "type" : "activation",
      "name" : "sigmoid_hard_7",
      "beta" : 0.5
    },
    {
      "bottom" : "input.91,sigmoid_hard_7",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.92",
      "top" : "input.92",
      "type" : "elementwise",
      "name" : "input.92",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.94",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.94",
      "K" : 184,
      "blob_biases" : 141,
      "name" : "input.94",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 184,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 184,
      "bottom" : "input.92",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 143
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.94",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "sigmoid_hard_8",
      "top" : "sigmoid_hard_8",
      "type" : "activation",
      "name" : "sigmoid_hard_8",
      "beta" : 0.5
    },
    {
      "bottom" : "input.94,sigmoid_hard_8",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.95",
      "top" : "input.95",
      "type" : "elementwise",
      "name" : "input.95",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "result.7",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "result.7",
      "K" : 184,
      "blob_biases" : 145,
      "name" : "result.7",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 80,
      "bottom" : "input.95",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 147
    },
    {
      "bottom" : "result.7,input.89",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.97",
      "nd_mode" : true,
      "top" : "input.97",
      "type" : "elementwise",
      "name" : "input.97",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.99",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.99",
      "K" : 80,
      "blob_biases" : 149,
      "name" : "input.99",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "input.97",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 151
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.99",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "sigmoid_hard_9",
      "top" : "sigmoid_hard_9",
      "type" : "activation",
      "name" : "sigmoid_hard_9",
      "beta" : 0.5
    },
    {
      "bottom" : "input.99,sigmoid_hard_9",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.100",
      "top" : "input.100",
      "type" : "elementwise",
      "name" : "input.100",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.102",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.102",
      "K" : 480,
      "blob_biases" : 153,
      "name" : "input.102",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 480,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "input.100",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 155
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.102",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "sigmoid_hard_10",
      "top" : "sigmoid_hard_10",
      "type" : "activation",
      "name" : "sigmoid_hard_10",
      "beta" : 0.5
    },
    {
      "bottom" : "input.102,sigmoid_hard_10",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.103",
      "top" : "input.103",
      "type" : "elementwise",
      "name" : "input.103",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "input.104",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 30,
      "is_global" : 1,
      "top" : "input.104",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "input.104",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "input.103",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 17,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.105",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.106",
      "K" : 480,
      "blob_biases" : 157,
      "name" : "input.105",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 120,
      "bottom" : "input.104",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 159
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.107",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.107",
      "K" : 120,
      "blob_biases" : 161,
      "name" : "input.107",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 480,
      "bottom" : "input.106",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 163
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.107",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "scale.4",
      "top" : "scale.4",
      "type" : "activation",
      "name" : "scale.4",
      "beta" : 0.5
    },
    {
      "bottom" : "scale.4,input.103",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.108",
      "nd_mode" : true,
      "top" : "input.108",
      "type" : "elementwise",
      "name" : "input.108",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.110",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.110",
      "K" : 480,
      "blob_biases" : 165,
      "name" : "input.110",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 112,
      "bottom" : "input.108",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 167
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.112",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.112",
      "K" : 112,
      "blob_biases" : 169,
      "name" : "input.112",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 672,
      "bottom" : "input.110",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 171
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.112",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "sigmoid_hard_11",
      "top" : "sigmoid_hard_11",
      "type" : "activation",
      "name" : "sigmoid_hard_11",
      "beta" : 0.5
    },
    {
      "bottom" : "input.112,sigmoid_hard_11",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.113",
      "top" : "input.113",
      "type" : "elementwise",
      "name" : "input.113",
      "beta" : 0
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.115",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "input.115",
      "K" : 672,
      "blob_biases" : 173,
      "name" : "input.115",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 672,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 672,
      "bottom" : "input.113",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1,
      "blob_weights_f16" : 175
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.115",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "sigmoid_hard_12",
      "top" : "sigmoid_hard_12",
      "type" : "activation",
      "name" : "sigmoid_hard_12",
      "beta" : 0.5
    },
    {
      "bottom" : "input.115,sigmoid_hard_12",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.116",
      "top" : "input.116",
      "type" : "elementwise",
      "name" : "input.116",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "input.117",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 30,
      "is_global" : 1,
      "top" : "input.117",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "input.117",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "input.116",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 17,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.118",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.119",
      "K" : 672,
      "blob_biases" : 177,
      "name" : "input.118",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 168,
      "bottom" : "input.117",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 179
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.120",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.120",
      "K" : 168,
      "blob_biases" : 181,
      "name" : "input.120",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 672,
      "bottom" : "input.119",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 183
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.120",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "scale.5",
      "top" : "scale.5",
      "type" : "activation",
      "name" : "scale.5",
      "beta" : 0.5
    },
    {
      "bottom" : "scale.5,input.116",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.121",
      "nd_mode" : true,
      "top" : "input.121",
      "type" : "elementwise",
      "name" : "input.121",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "result.8",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "result.8",
      "K" : 672,
      "blob_biases" : 185,
      "name" : "result.8",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 112,
      "bottom" : "input.121",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 187
    },
    {
      "bottom" : "result.8,input.110",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.123",
      "nd_mode" : true,
      "top" : "input.123",
      "type" : "elementwise",
      "name" : "input.123",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.125",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.125",
      "K" : 112,
      "blob_biases" : 189,
      "name" : "input.125",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 672,
      "bottom" : "input.123",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 191
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.125",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "sigmoid_hard_13",
      "top" : "sigmoid_hard_13",
      "type" : "activation",
      "name" : "sigmoid_hard_13",
      "beta" : 0.5
    },
    {
      "bottom" : "input.125,sigmoid_hard_13",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.126",
      "top" : "input.126",
      "type" : "elementwise",
      "name" : "input.126",
      "beta" : 0
    },
    {
      "pad_r" : 4,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.128",
      "pad_fill_mode" : 0,
      "pad_b" : 4,
      "pad_l" : 4,
      "top" : "input.128",
      "K" : 672,
      "blob_biases" : 193,
      "name" : "input.128",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 672,
      "pad_t" : 4,
      "has_biases" : 1,
      "C" : 672,
      "bottom" : "input.126",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 0,
      "dilation_x" : 2,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1,
      "dilation_y" : 2,
      "blob_weights_f16" : 195
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.128",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "sigmoid_hard_14",
      "top" : "sigmoid_hard_14",
      "type" : "activation",
      "name" : "sigmoid_hard_14",
      "beta" : 0.5
    },
    {
      "bottom" : "input.128,sigmoid_hard_14",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.129",
      "top" : "input.129",
      "type" : "elementwise",
      "name" : "input.129",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "input.130",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 30,
      "is_global" : 1,
      "top" : "input.130",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 0,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "input.130",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "input.129",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 17,
      "pad_value" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "input.131",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.132",
      "K" : 672,
      "blob_biases" : 197,
      "name" : "input.131",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 168,
      "bottom" : "input.130",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 199
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "input.133",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "input.133",
      "K" : 168,
      "blob_biases" : 201,
      "name" : "input.133",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 672,
      "bottom" : "input.132",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1,
      "blob_weights_f16" : 203
    },
    {
      "alpha" : 0.1666666716337204,
      "bottom" : "input.133",
      "weights" : {

      },
      "mode" : 7,
      "debug_info" : "scale.6",
      "top" : "scale.6",
      "type" : "activation",
      "name" : "scale.6",
      "beta" : 0.5
    },
    {
      "bottom" : "scale.6,input.129",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "input.134",
