<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Resources/Info.plist</key>
		<data>
		p6KlfO/myTg3hLw/MUD+nhh9dZY=
		</data>
		<key>Resources/rvm_mobilenetv3_1280x720_s0_375_fp16.mlmodelc/analytics/coremldata.bin</key>
		<data>
		I8yOGa1GFRrm3dqP+kjcwoB3iis=
		</data>
		<key>Resources/rvm_mobilenetv3_1280x720_s0_375_fp16.mlmodelc/coremldata.bin</key>
		<data>
		1YN1phSD339MUAGgksJ5p59iW6E=
		</data>
		<key>Resources/rvm_mobilenetv3_1280x720_s0_375_fp16.mlmodelc/metadata.json</key>
		<data>
		QlSMqnCHWibwXO4l2NciuPxKCYA=
		</data>
		<key>Resources/rvm_mobilenetv3_1280x720_s0_375_fp16.mlmodelc/model.espresso.net</key>
		<data>
		Fm64qalBr2w35SLqths47fHQDcc=
		</data>
		<key>Resources/rvm_mobilenetv3_1280x720_s0_375_fp16.mlmodelc/model.espresso.shape</key>
		<data>
		VyIpcfS4un9d5wtF7+Cw50ozAuo=
		</data>
		<key>Resources/rvm_mobilenetv3_1280x720_s0_375_fp16.mlmodelc/model.espresso.weights</key>
		<data>
		2d1Ia/7icxjuRHyzTL9WPmsSLLI=
		</data>
		<key>Resources/rvm_mobilenetv3_1280x720_s0_375_fp16.mlmodelc/model.rank.info.json</key>
		<data>
		G9jOKPMHXIaZBopGKOvWZJFbSho=
		</data>
		<key>Resources/rvm_mobilenetv3_1280x720_s0_375_fp16.mlmodelc/model/coremldata.bin</key>
		<data>
		9LPdv6wTnV+T8A6JRmxbQFYZGS4=
		</data>
		<key>Resources/rvm_mobilenetv3_1280x720_s0_375_fp16.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		RjuOPlYTioenRNCW8/mXfPHputs=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Headers/roboHumanMatting.h</key>
		<dict>
			<key>hash2</key>
			<data>
			bEBGYS1wdtPZpCTY4feggAYr5u4K9cK02f0At8x20/M=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash2</key>
			<data>
			PesGXNP8oXEnZ1Gm8N8wdxRgKBf3X1mjoS/wDmL/x2I=
			</data>
		</dict>
		<key>Resources/Info.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			3s1uzjs1BqMTy+uleLk/aEBjB4vyXWpydo418AOsiKI=
			</data>
		</dict>
		<key>Resources/rvm_mobilenetv3_1280x720_s0_375_fp16.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			PrGvhZs9N2GwSgKoGb+7KkagmJ3LnCC6FBFo4CihnOk=
			</data>
		</dict>
		<key>Resources/rvm_mobilenetv3_1280x720_s0_375_fp16.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			+X6uBHc1Bul8anms8J9TOT5nAnHanp9xkX/TKgaGk+o=
			</data>
		</dict>
		<key>Resources/rvm_mobilenetv3_1280x720_s0_375_fp16.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			ets6WxkfnrQdiRxjjADIXV20YAj25IdJKYwoUtXoEtE=
			</data>
		</dict>
		<key>Resources/rvm_mobilenetv3_1280x720_s0_375_fp16.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			/lAaOBXClqw2gnwV62dGAmGrKXj5ORi1hfMPZrGaxAg=
			</data>
		</dict>
		<key>Resources/rvm_mobilenetv3_1280x720_s0_375_fp16.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			nayH2VQ5UAoELm3ZwtG4nWJszJnPv453gZRdmkEk2z8=
			</data>
		</dict>
		<key>Resources/rvm_mobilenetv3_1280x720_s0_375_fp16.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			2kkcG7LWakcuyqd4R/CmMFrYXUWSCIqFO/f7bGRq1RA=
			</data>
		</dict>
		<key>Resources/rvm_mobilenetv3_1280x720_s0_375_fp16.mlmodelc/model.rank.info.json</key>
		<dict>
			<key>hash2</key>
			<data>
			+KWibjBW62+wbe6z28z9iK50kAIAyYxwtZZru37J1N4=
			</data>
		</dict>
		<key>Resources/rvm_mobilenetv3_1280x720_s0_375_fp16.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			fnleCoVUf1V0xTl6Ft551KLKRs5NIxPmxxzbqXRfzuQ=
			</data>
		</dict>
		<key>Resources/rvm_mobilenetv3_1280x720_s0_375_fp16.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			3aA39IBkjdNPQ29+FKmp5X6aia7FGPLcm6dRxecwtZw=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^Resources/</key>
		<true/>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^(Frameworks|SharedFrameworks|PlugIns|Plug-ins|XPCServices|Helpers|MacOS|Library/(Automator|Spotlight|LoginItems))/</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^[^/]+$</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
